Revit 2022 API
AnalyticalModelSurface.BottomExtensionMethod Property
 The bottom extension method option.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2015
Syntax
C#
public AnalyticalAlignmentMethod BottomExtensionMethod { get; set; }
Visual Basic
Public Property BottomExtensionMethod As AnalyticalAlignmentMethod
	Get
	Set
Visual C++
public:
property AnalyticalAlignmentMethod BottomExtensionMethod {
	AnalyticalAlignmentMethod get ();
	void set (AnalyticalAlignmentMethod value);
}
Remarks
 Analytical model elements for walls support extension options, while those for floor or slabs do not. If used on analytical model that do not support extension, exception InvalidOperationException will be thrown. To chcek if analytical model support extension use HasExtension property.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace